class Tags {
  String title;
  Tags(this.title);
}

List<Tags> listTag = [
  Tags("جاوا"),
  Tags("سی شارپ"),
  Tags("پایتون"),
  Tags("جاوا اسکریپت"),
  Tags("پی اچ پی"),
  Tags("دارت"),
  Tags("کوبول"),
  Tags("گولنگ"),
  Tags("اف شارپ"),
  Tags("اندروید"),
  Tags("آی او اس"),
  Tags("سی"),
  Tags("سی پلاس پلاس"),
];

List<Tags> myCategory = [
  //Tags("جاوا"),
];

class BlogModel {
  int id;
  String writer;
  String likes;
  String content;
  String imageUrl;
  BlogModel(this.id, this.writer, this.likes, this.content, this.imageUrl);
}

List<BlogModel> listBlogModel = [
  BlogModel(
      1,
      "امین تقوی",
      "234",
      """ماسک از ارول ماسک و می ماسک در پرتوریا، آفریقای جنوبی به دنیا آمد. او مدت کوتاهی در دانشگاه پرتوریا به تحصیل پرداخت و در ۱۸ سالگی به کانادا رفت که از طریق مادر کانادایی‌تبارش تابعیت این کشور را به دست آورد.[۸] دو سال بعد به دانشگاه پنسیلوانیا رفت و در آن جا کارشناسی اقتصاد و فیزیک خود را گرفت. او در سال ۱۹۹۵ برای تحصیل در دانشگاه استنفورد به کالیفرنیا نقل مکان کرد اما بعد از دو روز ترک تحصیل کرد و به‌همراه برادرش کیمبال، شرکت نرم‌افزاری راهنمای سفر آنلاین زیپ۲ را تأسیس کرد. این شرکت نوپا در سال ۱۹۹۹ به‌مبلغ ۳۰۷ میلیون دلار توسط کامپک خریداری شد و با ۱۲ میلیون دلاری که به دست آورد، ماسک همان سال مشترکاً بانکداری مستقیم X.com را تأسیس کرد که در سال ۲۰۰۰ با کنفینیتی ادغام شد و باعث تشکیل پی‌پل شد""",
      "https://picsum.photos/250?image=9"),
  BlogModel(
      2,
      "محمد تقوی",
      "267",
      """جف بیزوس در ۱۲ ژانویه سال ۱۹۶۴ در آلبوکرکی، نیو مکزیکو زاده شد.[۱۱] مادر او هنگام تولدش نوجوان بود. پدرش تد جورگنسن اهل شیکاگو و مالک دوچرخه‌فروشی بود و زندگی پدر و مادر او بیش از یک سال دوام نداشت و هنگامی که جف نوزاد بود آنها از هم طلاق گرفتند. مادر جف در حالی که جف ۵ سال بیشتر نداشت برای رهایی از بی‌خانمانی با یک مهاجر کوبایی که برای تحصیل به آمریکا مهاجرت کرده بود به نام میگل «مایک» بیزوس ازدواج کرد. مایک بیزوس مدت کوتاهی پس از ازدواج، جف جورگنسن را به فرزندخواندگی پذیرفت و نام خانوادگی او را به بیزوس تغییر داد. پدرخواندهٔ جف پس از پایان تحصیل در شرکتی به نام اکسون به عنوان مهندس آغاز به کار کرد""",
      "https://picsum.photos/250?image=1"),
  BlogModel(
      3,
      "امین تقوی",
      "234",
      """ماسک از ارول ماسک و می ماسک در پرتوریا، آفریقای جنوبی به دنیا آمد. او مدت کوتاهی در دانشگاه پرتوریا به تحصیل پرداخت و در ۱۸ سالگی به کانادا رفت که از طریق مادر کانادایی‌تبارش تابعیت این کشور را به دست آورد.[۸] دو سال بعد به دانشگاه پنسیلوانیا رفت و در آن جا کارشناسی اقتصاد و فیزیک خود را گرفت. او در سال ۱۹۹۵ برای تحصیل در دانشگاه استنفورد به کالیفرنیا نقل مکان کرد اما بعد از دو روز ترک تحصیل کرد و به‌همراه برادرش کیمبال، شرکت نرم‌افزاری راهنمای سفر آنلاین زیپ۲ را تأسیس کرد. این شرکت نوپا در سال ۱۹۹۹ به‌مبلغ ۳۰۷ میلیون دلار توسط کامپک خریداری شد و با ۱۲ میلیون دلاری که به دست آورد، ماسک همان سال مشترکاً بانکداری مستقیم X.com را تأسیس کرد که در سال ۲۰۰۰ با کنفینیتی ادغام شد و باعث تشکیل پی‌پل شد""",
      "https://picsum.photos/250?image=9"),
  BlogModel(
      4,
      "محمد تقوی",
      "267",
      """جف بیزوس در ۱۲ ژانویه سال ۱۹۶۴ در آلبوکرکی، نیو مکزیکو زاده شد.[۱۱] مادر او هنگام تولدش نوجوان بود. پدرش تد جورگنسن اهل شیکاگو و مالک دوچرخه‌فروشی بود و زندگی پدر و مادر او بیش از یک سال دوام نداشت و هنگامی که جف نوزاد بود آنها از هم طلاق گرفتند. مادر جف در حالی که جف ۵ سال بیشتر نداشت برای رهایی از بی‌خانمانی با یک مهاجر کوبایی که برای تحصیل به آمریکا مهاجرت کرده بود به نام میگل «مایک» بیزوس ازدواج کرد. مایک بیزوس مدت کوتاهی پس از ازدواج، جف جورگنسن را به فرزندخواندگی پذیرفت و نام خانوادگی او را به بیزوس تغییر داد. پدرخواندهٔ جف پس از پایان تحصیل در شرکتی به نام اکسون به عنوان مهندس آغاز به کار کرد""",
      "https://picsum.photos/250?image=1"),
  BlogModel(
      5,
      "امین تقوی",
      "234",
      """ماسک از ارول ماسک و می ماسک در پرتوریا، آفریقای جنوبی به دنیا آمد. او مدت کوتاهی در دانشگاه پرتوریا به تحصیل پرداخت و در ۱۸ سالگی به کانادا رفت که از طریق مادر کانادایی‌تبارش تابعیت این کشور را به دست آورد.[۸] دو سال بعد به دانشگاه پنسیلوانیا رفت و در آن جا کارشناسی اقتصاد و فیزیک خود را گرفت. او در سال ۱۹۹۵ برای تحصیل در دانشگاه استنفورد به کالیفرنیا نقل مکان کرد اما بعد از دو روز ترک تحصیل کرد و به‌همراه برادرش کیمبال، شرکت نرم‌افزاری راهنمای سفر آنلاین زیپ۲ را تأسیس کرد. این شرکت نوپا در سال ۱۹۹۹ به‌مبلغ ۳۰۷ میلیون دلار توسط کامپک خریداری شد و با ۱۲ میلیون دلاری که به دست آورد، ماسک همان سال مشترکاً بانکداری مستقیم X.com را تأسیس کرد که در سال ۲۰۰۰ با کنفینیتی ادغام شد و باعث تشکیل پی‌پل شد""",
      "https://picsum.photos/250?image=9"),
  BlogModel(
      6,
      "محمد تقوی",
      "267",
      """جف بیزوس در ۱۲ ژانویه سال ۱۹۶۴ در آلبوکرکی، نیو مکزیکو زاده شد.[۱۱] مادر او هنگام تولدش نوجوان بود. پدرش تد جورگنسن اهل شیکاگو و مالک دوچرخه‌فروشی بود و زندگی پدر و مادر او بیش از یک سال دوام نداشت و هنگامی که جف نوزاد بود آنها از هم طلاق گرفتند. مادر جف در حالی که جف ۵ سال بیشتر نداشت برای رهایی از بی‌خانمانی با یک مهاجر کوبایی که برای تحصیل به آمریکا مهاجرت کرده بود به نام میگل «مایک» بیزوس ازدواج کرد. مایک بیزوس مدت کوتاهی پس از ازدواج، جف جورگنسن را به فرزندخواندگی پذیرفت و نام خانوادگی او را به بیزوس تغییر داد. پدرخواندهٔ جف پس از پایان تحصیل در شرکتی به نام اکسون به عنوان مهندس آغاز به کار کرد""",
      "https://picsum.photos/250?image=1")
];
